Repository: IKANISA1/cool
Catalog: mobility_app/lib/l10n/app_*.arb
Languages: rw

source: Welcome
rw: Murakaza neza

# continueButton
source: Continue
rw: Komeza

source: Cancel
rw: Hagarika

source: Save
rw: Bika

source: Delete
rw: Siba

source: Edit
rw: Hindura

source: Loading...
rw: Gutegereza...

source: Retry
rw: Ongera ugerageze

source: Error
rw: Ikosa

source: Success
rw: Byagenze neza

# phoneAuthTitle
source: Enter your phone number
rw: Shyiramo nimero ya terefone yawe

# phoneAuthSubtitle
source: We'll send you a verification code
rw: Tuzakohereza kode yo kwemeza

# phoneNumberLabel
source: Phone Number
rw: Nimero ya terefone

source: Send Code
rw: Ohereza kode

# otpTitle
source: Verification
rw: Kwemeza

# otpSubtitle
source: Enter the code sent to {phone}
rw: Shyiramo kode yoherejwe kuri {phone}

# verifyCode
source: Verify
rw: Emeza

source: Resend Code
rw: Ongera wohereze kode

# codeExpires
source: Code expires in {seconds} seconds
rw: Kode irangira mu masegonda {seconds}

# discoveryTitle
source: Nearby
rw: Hafi yawe

source: Find Drivers
rw: Shakira abashoferi

source: Find Passengers
rw: Shakira abagenzi

source: Search Radius
rw: Urugero rwo gushakira

source: No users nearby
rw: Nta mukoresha uri hafi

# adjustRadius
source: Try adjusting your search radius
rw: Gerageza guhindura urugero rwo gushakira

# profileTitle
source: Profile
rw: Umwirondoro

source: Edit Profile
rw: Hindura umwirondoro

source: Name
rw: Izina

source: Role
rw: Uruhare

# roleDriver
source: Driver
rw: Umushoferi

# rolePassenger
source: Passenger
rw: Umugenzi

# roleBoth
source: Both
rw: Byombi

source: Language
rw: Ururimi

source: Rating
rw: Amanota

source: Verified
rw: Byemejwe

# vehicleTitle
source: My Vehicles
rw: Imodoka zanjye

source: Add Vehicle
rw: Ongeraho imodoka

# vehicleCategory
source: Category
rw: Ubwoko

# vehiclePlate
source: Plate Number
rw: Nimero ya plaki

# vehicleCapacity
source: Capacity
rw: Uburemere

# vehicleCategoryMoto
source: Motorcycle
rw: Moto

# vehicleCategoryCab
source: Taxi Cab
rw: Tagisi

# vehicleCategoryTruck
source: Truck
rw: Ikamyo

# vehicleCategoryRent
source: Rental
rw: Gukodesha

# requestsTitle
source: Requests
rw: Ibisabwa

# incomingRequests
source: Incoming
rw: Byaje

# outgoingRequests
source: Outgoing
rw: Byoherejwe

# pendingRequests
source: Pending
rw: Bitegereje

# acceptRequest
source: Accept
rw: Emera

# declineRequest
source: Decline
rw: Anga

source: Request expired
rw: Icyifuzo cyarangiye

# noRequests
source: No pending requests
rw: Nta cyifuzo gitegereje

source: No incoming requests
rw: Nta cyifuzo cyaje

source: No outgoing requests
rw: Nta cyifuzo cyoherejwe

# incomingRequestsHint
source: Requests from other users will appear here
rw: Ibisabwa by'abandi bakoresha bizagaragara hano

# outgoingRequestsHint
source: Requests you send will appear here
rw: Ibisabwa wohereza bizagaragara hano

# requestStatusPending
source: Pending
rw: Gitegereje

# requestStatusAccepted
source: Accepted
rw: Cyemewe

# requestStatusDenied
source: Denied
rw: Cyangiwe

# requestStatusExpired
source: Expired
rw: Cyarangiye

# requestStatusCancelled
source: Cancelled
rw: Cyahagaritswe

source: Just now
rw: Ubu nyine

# minutesAgo
source: {minutes}m ago
rw: hashize {minutes}m

# hoursAgo
source: {hours}h ago
rw: hashize {hours}h

# daysAgo
source: {days}d ago
rw: hashize {days}d

# scheduleTitle
source: Schedule Trip
rw: Teganya urugendo

# scheduleOffer
source: Offer a Ride
rw: Tanga urugendo

# scheduleRequest
source: Request a Ride
rw: Saba urugendo

source: From
rw: Kuva

source: To
rw: Kuri

source: When
rw: Ryari

source: Seats
rw: Intebe

source: Vehicle Type
rw: Ubwoko bw'imodoka

source: Notes
rw: Ibitekerezo

# scheduleTrip
source: Schedule
rw: Teganya

# aiAssistantTitle
source: AI Assistant
rw: Umufasha AI

# aiAssistantHint
source: How can I help you today?
rw: Nakugufasha nte?

# typeMessage
source: Type a message...
rw: Andika ubutumwa...

# settingsTitle
source: Settings
rw: Igenamiterere

source: Dark Mode
rw: Uburyo bwijimye

source: Notifications
rw: Imenyesha

# language_settings
source: Language
rw: Ururimi

source: Privacy Policy
rw: Politiki y'ubuzima bwite

source: Terms of Service
rw: Amategeko y'ikoreshwa

source: Log Out
rw: Sohoka

source: Version
rw: Verisiyo

# locationPermissionTitle
source: Location Permission
rw: Uruhushya rw'aho uri

# locationPermissionMessage
source: Location is required to find nearby users
rw: Aho uri birakenewe kugira ngo tubone abakoresha bari hafi

source: Grant Permission
rw: Tanga uruhushya

source: {distance} away
rw: kuri {distance}

# lastSeen
source: Last seen {time}
rw: Yabonwe hashize {time}

source: Online now
rw: Ari ku murongo
